# 全局公共参数

**全局Header参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**全局Query参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**全局Body参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**全局认证方式**

> 无需认证

# 状态码说明

| 状态码 | 中文描述 |
| --- | ---- |
| 暂无参数 |

# 管理后台

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:37:42

> 更新时间: 2026-01-12 15:35:36

```text
暂无描述
```

**目录Header参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录Query参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录Body参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录认证信息**

> 继承父级

**Query**

## 验证码

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 15:35:47

> 更新时间: 2026-01-12 15:35:56

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/checkCode

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 登录

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:04:17

> 更新时间: 2026-01-12 16:05:17

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/login

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 退出

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:04:26

> 更新时间: 2026-01-12 16:04:26

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/logout

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取资源

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:04:35

> 更新时间: 2026-01-12 16:04:44

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /api/file/getResource

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 上传图片

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:05:01

> 更新时间: 2026-01-12 16:31:48

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /file/uploadImage

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取分类

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:05:24

> 更新时间: 2026-01-12 16:05:30

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/loadCategory

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 保存分类

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:05:42

> 更新时间: 2026-01-12 16:07:33

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/saveCategory

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除分类

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:05:51

> 更新时间: 2026-01-12 16:05:51

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/delCategory

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 修改分类排序

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:05:59

> 更新时间: 2026-01-12 16:07:30

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/changeCategorySort

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 保存商品属性

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:06:39

> 更新时间: 2026-01-12 16:07:28

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/saveProductProperty

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除商品属性

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:06:49

> 更新时间: 2026-01-12 16:06:49

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /sysCategory/delProductProperty

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 新增商品

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:07:47

> 更新时间: 2026-01-12 16:08:06

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/addProduct

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 修改商品

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:07:58

> 更新时间: 2026-01-12 16:08:09

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/updateProduct

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取商品详情

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:08:28

> 更新时间: 2026-01-12 16:08:28

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/getProductInfo

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取商品列表

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:08:36

> 更新时间: 2026-01-12 16:08:41

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/loadProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 更新库存

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:08:56

> 更新时间: 2026-01-12 16:30:57

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/updateSkuStock

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 修改状态

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:09:08

> 更新时间: 2026-01-12 16:31:00

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/updateProductStatus

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 推荐商品

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:09:28

> 更新时间: 2026-01-12 16:09:28

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/commendProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除商品

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:17:36

> 更新时间: 2026-01-12 16:17:36

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productInfo/deleteProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 订单状态

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:17:45

> 更新时间: 2026-01-12 16:17:50

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/loadOrderStatus

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 订单列表

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:18:02

> 更新时间: 2026-01-12 16:18:02

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/loadOrder

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取物流信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:18:20

> 更新时间: 2026-01-12 16:18:24

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getLogistics

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 发货

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:18:33

> 更新时间: 2026-01-12 16:31:06

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/delivery

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:18:48

> 更新时间: 2026-01-12 16:18:48

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getComment

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 商家评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:18:59

> 更新时间: 2026-01-12 16:31:10

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/bizComment

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:19:10

> 更新时间: 2026-01-12 16:31:13

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/loadComment

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:19:18

> 更新时间: 2026-01-12 16:19:18

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/delComment

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取用户信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:19:29

> 更新时间: 2026-01-12 16:19:29

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /user/loadUser

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 启用禁用用户

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:19:44

> 更新时间: 2026-01-12 16:31:16

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /user/changeStatus

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 保存系统发货地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:23:47

> 更新时间: 2026-01-12 16:31:19

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/saveLogistics

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取发货地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:24:01

> 更新时间: 2026-01-12 16:31:33

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/getLogistics

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取提示词列表

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:24:12

> 更新时间: 2026-01-12 16:24:12

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/loadPromptList

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取提示词详情

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:25:08

> 更新时间: 2026-01-12 16:25:08

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/getPromptDetail

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 保存提示词

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:25:17

> 更新时间: 2026-01-12 16:31:27

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/savePrompt

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 清空提示词

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:25:28

> 更新时间: 2026-01-12 16:25:28

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /setting/cleanPromptCache

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 分页查询

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:25:44

> 更新时间: 2026-01-12 16:25:44

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /rag/loadRagQuestion

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 保存rag

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:25:54

> 更新时间: 2026-01-12 16:31:24

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /rag/saveRagQuestion

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除rag

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:26:03

> 更新时间: 2026-01-12 16:26:03

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /rag/delRagQuestion

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 首页当日数据

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:26:18

> 更新时间: 2026-01-12 16:26:18

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /home/getTodayData

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 首页周数据

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:26:30

> 更新时间: 2026-01-12 16:26:30

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /home/loadWeeklyStatisticsData

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 首页库存告警

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 16:26:45

> 更新时间: 2026-01-12 16:26:45

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /home/loadLessStockProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

# 访客端

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:37:51

> 更新时间: 2026-01-12 15:35:29

```text
暂无描述
```

**目录Header参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录Query参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录Body参数**

| 参数名 | 示例值 | 参数类型 | 是否必填 | 参数描述 |
| --- | --- | ---- | ---- | ---- |
| 暂无参数 |

**目录认证信息**

> 继承父级

**Query**

## 验证码

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:38:35

> 更新时间: 2026-01-12 14:38:41

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/checkCode

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取资源地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:39:22

> 更新时间: 2026-01-12 14:39:50

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /api/file/getResource

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 上传图片

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:39:39

> 更新时间: 2026-01-12 14:39:44

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /file/uploadImage

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 登录

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:40:16

> 更新时间: 2026-01-12 14:40:46

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/login

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 退出登录

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:40:37

> 更新时间: 2026-01-12 14:40:43

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/logout

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 注册

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:40:58

> 更新时间: 2026-01-12 14:41:20

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/register

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 自动登录

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:45:47

> 更新时间: 2026-01-12 14:45:58

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/autoLogin

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取个人信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:46:15

> 更新时间: 2026-01-12 14:46:15

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/getUserInfo

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 修改个人信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:46:27

> 更新时间: 2026-01-12 14:46:35

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /account/updateUserInfo

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取分类

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:46:50

> 更新时间: 2026-01-12 14:57:30

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /product/loadCategory

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取推荐商品

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:47:03

> 更新时间: 2026-01-12 14:57:36

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /product/loadCommendProduct

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取商品列表

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:47:16

> 更新时间: 2026-01-12 14:47:16

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /product/loadProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取商品信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:47:26

> 更新时间: 2026-01-12 14:47:26

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /product/getProduct

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 搜索

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:47:37

> 更新时间: 2026-01-12 14:47:37

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /product/search

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取用户地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:47:56

> 更新时间: 2026-01-12 14:47:56

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /userAddress/loadDataList

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 新增地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:48:13

> 更新时间: 2026-01-12 14:48:13

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /userAddress/addAddress

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 修改地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:50:42

> 更新时间: 2026-01-12 14:57:46

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /userAddress/updateAddress

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除地址

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:56:20

> 更新时间: 2026-01-12 14:57:49

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /userAddress/delAddress

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 设为默认

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:51:03

> 更新时间: 2026-01-12 14:57:52

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /userAddress/updateDefault

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 购物车列表

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:51:24

> 更新时间: 2026-01-12 14:57:55

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productCart/loadProductCart

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 加入购物车

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:51:33

> 更新时间: 2026-01-12 14:57:58

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productCart/add2Cart

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 移除购物车

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:51:44

> 更新时间: 2026-01-12 14:51:44

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /productCart/deleteCart

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 提交订单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:51:56

> 更新时间: 2026-01-12 14:51:56

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/postOrder

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取订单详情

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:52:07

> 更新时间: 2026-01-12 14:52:07

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getOrderInfo

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 查询我的订单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:52:19

> 更新时间: 2026-01-12 14:52:19

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/loadMyOrder

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取支付信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:52:32

> 更新时间: 2026-01-12 14:52:32

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getPayInfo

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 取消订单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:52:45

> 更新时间: 2026-01-12 14:59:28

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/cancelOrder

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 取消订单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:52:59

> 更新时间: 2026-01-12 14:59:20

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/deleteOrder

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除订单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:53:09

> 更新时间: 2026-01-12 14:59:25

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/deleteOrder

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 确认下单

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:53:24

> 更新时间: 2026-01-12 14:59:23

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/confirmOrder

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 退款

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:53:33

> 更新时间: 2026-01-12 14:53:33

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/refundOrder

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 物流信息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:53:48

> 更新时间: 2026-01-12 14:53:48

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getLogistics

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取评价

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:54:10

> 更新时间: 2026-01-12 14:54:10

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/getComment

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 评价

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:54:40

> 更新时间: 2026-01-12 14:59:12

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/postComment

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 追评

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:54:53

> 更新时间: 2026-01-12 14:59:10

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/postReComment

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取商品所有评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:04

> 更新时间: 2026-01-12 14:55:04

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/loadComment

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 获取我的评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:17

> 更新时间: 2026-01-12 14:55:17

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/loadMyComment

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 删除评论

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:27

> 更新时间: 2026-01-12 14:59:03

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/comment/delMyComment

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 订单数量

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:36

> 更新时间: 2026-01-12 14:55:36

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /order/getOrderCountInfo

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 【智能体】发送消息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:46

> 更新时间: 2026-01-12 14:58:44

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /agent/sendMessage

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 【智能体】取消消息发送

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:55:56

> 更新时间: 2026-01-12 14:58:41

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /agent/cancelMessage

**请求方式**

> POST

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**

## 【智能体】获取历史消息

> 创建人: 程序员老罗

> 更新人: 程序员老罗

> 创建时间: 2026-01-12 14:57:03

> 更新时间: 2026-01-12 14:57:21

```text
暂无描述
```

**接口状态**

> 开发中

**接口URL**

> /agent/loadHistoryMessage

**请求方式**

> GET

**Content-Type**

> none

**认证方式**

> 继承父级

**响应示例**

* 成功(200)

```javascript
暂无数据
```

* 失败(404)

```javascript
暂无数据
```

**Query**
